[Killed] BlockStatement
src/cycle_sort.ts:10:47
  * @example cycleSort([8, 3, 5, 1, 4, 2]) = [1, 2, 3, 4, 5, 8]
  */
 
-export const cycleSort = (array: number[]) => {
-  for (let i: number = 0; i < array.length - 1; i++) {
-    MoveCycle(array, i)
-  }
-  return array
-}
+export const cycleSort = (array: number[]) => {}
 
 function MoveCycle(array: number[], startIndex: number): void {
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/cycle_sort.ts:11:27
  */
 
 export const cycleSort = (array: number[]) => {
-  for (let i: number = 0; i < array.length - 1; i++) {
+  for (let i: number = 0; i >= array.length - 1; i++) {
     MoveCycle(array, i)
   }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/cycle_sort.ts:11:54
  */
 
 export const cycleSort = (array: number[]) => {
-  for (let i: number = 0; i < array.length - 1; i++) {
-    MoveCycle(array, i)
-  }
+  for (let i: number = 0; i < array.length - 1; i++) {}
   return array
 }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/cycle_sort.ts:17:63
   return array
 }
 
-function MoveCycle(array: number[], startIndex: number): void {
-  let currentItem: number = array[startIndex]
-  let nextChangeIndex: number =
-    startIndex + CountSmallerItems(array, startIndex, currentItem)
-  if (nextChangeIndex == startIndex) {
-    return
-  }
-
-  nextChangeIndex = SkipDuplicates(array, nextChangeIndex, currentItem)
-
-  let tmp: number = array[nextChangeIndex]
-  array[nextChangeIndex] = currentItem
-  currentItem = tmp
-
-  while (nextChangeIndex != startIndex) {
-    nextChangeIndex =
-      startIndex + CountSmallerItems(array, startIndex, currentItem)
-    nextChangeIndex = SkipDuplicates(array, nextChangeIndex, currentItem)
-
-    tmp = array[nextChangeIndex]
-    array[nextChangeIndex] = currentItem
-    currentItem = tmp
-  }
-}
+function MoveCycle(array: number[], startIndex: number): void {}
 
 function CountSmallerItems(
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
src/cycle_sort.ts:20:5
 function MoveCycle(array: number[], startIndex: number): void {
   let currentItem: number = array[startIndex]
   let nextChangeIndex: number =
-    startIndex + CountSmallerItems(array, startIndex, currentItem)
+    startIndex - CountSmallerItems(array, startIndex, currentItem)
   if (nextChangeIndex == startIndex) {
     return
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   undefined,

[Killed] ConditionalExpression
src/cycle_sort.ts:21:7
   let currentItem: number = array[startIndex]
   let nextChangeIndex: number =
     startIndex + CountSmallerItems(array, startIndex, currentItem)
-  if (nextChangeIndex == startIndex) {
+  if (true) {
     return
   }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/cycle_sort.ts:21:7
   let currentItem: number = array[startIndex]
   let nextChangeIndex: number =
     startIndex + CountSmallerItems(array, startIndex, currentItem)
-  if (nextChangeIndex == startIndex) {
+  if (nextChangeIndex != startIndex) {
     return
   }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/cycle_sort.ts:31:10
   array[nextChangeIndex] = currentItem
   currentItem = tmp
 
-  while (nextChangeIndex != startIndex) {
+  while (false) {
     nextChangeIndex =
       startIndex + CountSmallerItems(array, startIndex, currentItem)
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/cycle_sort.ts:31:10
   array[nextChangeIndex] = currentItem
   currentItem = tmp
 
-  while (nextChangeIndex != startIndex) {
+  while (nextChangeIndex == startIndex) {
     nextChangeIndex =
       startIndex + CountSmallerItems(array, startIndex, currentItem)
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Survived] ArithmeticOperator
src/cycle_sort.ts:33:7
 
   while (nextChangeIndex != startIndex) {
     nextChangeIndex =
-      startIndex + CountSmallerItems(array, startIndex, currentItem)
+      startIndex - CountSmallerItems(array, startIndex, currentItem)
     nextChangeIndex = SkipDuplicates(array, nextChangeIndex, currentItem)
 

[Timeout] BlockStatement
src/cycle_sort.ts:46:11
   array: number[],
   startIndex: number,
   currentItem: number
-): number {
-  let elementsCount: number = 0
-
-  for (let i: number = startIndex + 1; i < array.length; i++) {
-    if (currentItem > array[i]) {
-      elementsCount++
-    }
-  }
-
-  return elementsCount
-}
+): number {}
 
 function SkipDuplicates(

[Killed] EqualityOperator
src/cycle_sort.ts:49:40
 ): number {
   let elementsCount: number = 0
 
-  for (let i: number = startIndex + 1; i < array.length; i++) {
+  for (let i: number = startIndex + 1; i >= array.length; i++) {
     if (currentItem > array[i]) {
       elementsCount++
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/cycle_sort.ts:49:63
 ): number {
   let elementsCount: number = 0
 
-  for (let i: number = startIndex + 1; i < array.length; i++) {
-    if (currentItem > array[i]) {
-      elementsCount++
-    }
-  }
+  for (let i: number = startIndex + 1; i < array.length; i++) {}
 
   return elementsCount
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/cycle_sort.ts:50:33
   let elementsCount: number = 0
 
   for (let i: number = startIndex + 1; i < array.length; i++) {
-    if (currentItem > array[i]) {
-      elementsCount++
-    }
+    if (currentItem > array[i]) {}
   }
 
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/cycle_sort.ts:50:9
   let elementsCount: number = 0
 
   for (let i: number = startIndex + 1; i < array.length; i++) {
-    if (currentItem > array[i]) {
+    if (false) {
       elementsCount++
     }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] UpdateOperator
src/cycle_sort.ts:51:7
 
   for (let i: number = startIndex + 1; i < array.length; i++) {
     if (currentItem > array[i]) {
-      elementsCount++
+      elementsCount--
     }
   }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   undefined,

[Timeout] BlockStatement
src/cycle_sort.ts:62:11
   array: number[],
   currentPosition: number,
   currentItem: number
-): number {
-  while (array[currentPosition] == currentItem) {
-    currentPosition++
-  }
-
-  return currentPosition
-}
+): number {}
 

[Survived] ConditionalExpression
src/cycle_sort.ts:63:10
   currentPosition: number,
   currentItem: number
 ): number {
-  while (array[currentPosition] == currentItem) {
+  while (false) {
     currentPosition++
   }

[NoCoverage] BlockStatement
src/cycle_sort.ts:63:49
   currentPosition: number,
   currentItem: number
 ): number {
-  while (array[currentPosition] == currentItem) {
-    currentPosition++
-  }
+  while (array[currentPosition] == currentItem) {}
 
   return currentPosition

[NoCoverage] UpdateOperator
src/cycle_sort.ts:64:5
   currentItem: number
 ): number {
   while (array[currentPosition] == currentItem) {
-    currentPosition++
+    currentPosition--
   }
 
