[Killed] ConditionalExpression
src/cycle_sort.ts:11:27
  */
 
 export const cycleSort = (array: number[]) => {
-  for (let i: number = 0; i < array.length - 1; i++) {
+  for (let i: number = 0; false; i++) {
     MoveCycle(array, i)
   }
killedBy: Sorts an array correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   4,
    1,

[Timeout] ConditionalExpression
src/cycle_sort.ts:21:7
   let currentItem: number = array[startIndex]
   let nextChangeIndex: number =
     startIndex + CountSmallerItems(array, startIndex, currentItem)
-  if (nextChangeIndex == startIndex) {
+  if (false) {
     return
   }
